In [ ]:
import pandas as pd
pandas.__version__

In [ ]:
df = pd.read_csv('C:/Temp/Dataset/data/gapminder.tsv', sep ='\t')
df.head()

In [ ]:
df.info()

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
#access index
df.index

In [ ]:
# get values which is a numpy array of dataset
df.values

In [ ]:
#subset data using double brackets 
subset = df[['country', 'continent', 'year']]
subset.head()

In [ ]:
#locate specific row using iloc index based
df.iloc[2]

In [ ]:
#loc is label based , say we want to get certain columns and all rows
subset = df.loc[:, ['year', 'pop']]
subset.head()

In [ ]:
#let say we want to get specific row  with colum
df.loc[df['year'] == 1967, ['year', 'pop']]

In [ ]:
df.loc[df['country'] == 'United States']

In [ ]:
#get rows from conditon year in 1967 and pop greater than 1 million
df.loc[(df['year'] == 1967) & ( df['pop'] > 1000000), ['year', 'pop']]

Tyding messing data 
1. Columns headers are  values not variable name
2. Multiple columns are stores in one column
3. Variables are stores in both rows and columns
4. Multiple types of observational units are stored in the same table

# 1. Columns headers are  values not variable name

In [ ]:

df = pd.read_csv('C:/Temp/Dataset/data/pew.csv')
df.head()

In [ ]:
df_long = pd.melt(df, id_vars = 'religion') # id_vars is variables you dont want to change
df_long.head()

In [ ]:
# assign name to deadult variable and value
df_long = pd.melt(df, id_vars = 'religion', var_name = 'income', value_name = 'count')
df_long.head()

In [ ]:
# more example
df = pd.read_csv('C:/Temp/Dataset/data/billboard.csv')
df.head()
#df.shape

In [ ]:
# more columns as id_vars.
df1_long = pd.melt(df, id_vars = ['year', 'artist', 'track', 'time', 'date.entered'], var_name ='week', value_name = 'rating')
df1_long.head()
df1_long.shape

# 2. Multiple columns are stores in one column

In [ ]:

df2 = pd.read_csv('C:/Temp/Dataset/data/country_timeseries.csv')
df2.head()

In [ ]:
df2_long = pd.melt(df2, id_vars =['Date', 'Day'], var_name = 'cases_country', value_name = 'count')
df2_long.head()

In [ ]:
#now to need to split the vases_country with "-" 
var_split = df2_long['cases_country'].str.split("_")
type(var_split)

In [ ]:
#get 1st column 
var_split.str.get(0)

In [ ]:
var_split.str.get(1)

In [ ]:
df2_long['status'] = var_split.str.get(0)

In [ ]:
df2_long['country'] = var_split.str.get(1)

In [ ]:
df2_long.head()

In [ ]:
# OR use expand argument of str to complete in one line
df2_long[['status', 'country']] =df2_long['cases_country'].str.split("_", expand =True)
df2_long.head()

# 3. Variables are stores in both rows and columns

In [ ]:

df3 = pd.read_csv('C:/Temp/Dataset/data/weather.csv')
df3.head()# we see that columns stored in both row and column (element - tmax and tmin)

In [ ]:
df3_melt = pd.melt(df3, id_vars =['id', 'year', 'month', 'element'], var_name = 'day', value_name = 'temp') 
df3_melt.head()

In [ ]:
# use pivot table to break the elment column 
df3_pivot = pd.pivot_table(df3_melt, index = ['id', 'year', 'month', 'day'], columns = 'element', values = 'temp')
df3_pivot.head()

In [ ]:
# dats above has hierach.
df3_pivot.reset_index()

# 4. Multiple types of observational units are stored in the same table

In [ ]:
df1_long.head()

In [102]:
# the row o has been entered 72 times, is not effcient to storeage in database
df1_song = df1_long[['year', 'artist', 'track', 'time']]
df1_song.head()

   year        artist                    track  time
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22
1  2000       2Ge+her  The Hardest Part Of ...  3:15
2  2000  3 Doors Down               Kryptonite  3:53
3  2000  3 Doors Down                    Loser  4:24
4  2000      504 Boyz            Wobble Wobble  3:35

In [103]:
df1_song.shape

(24092, 4)

In [105]:
 df1_song.drop_duplicates()

     year            artist                    track  time
0    2000             2 Pac  Baby Don't Cry (Keep...  4:22
1    2000           2Ge+her  The Hardest Part Of ...  3:15
2    2000      3 Doors Down               Kryptonite  3:53
3    2000      3 Doors Down                    Loser  4:24
4    2000          504 Boyz            Wobble Wobble  3:35
..    ...               ...                      ...   ...
312  2000       Yankee Grey     Another Nine Minutes  3:10
313  2000  Yearwood, Trisha          Real Live Woman  3:55
314  2000   Ying Yang Twins  Whistle While You Tw...  4:19
315  2000     Zombie Nation            Kernkraft 400  3:30
316  2000   matchbox twenty                     Bent  4:12

[317 rows x 4 columns]

In [106]:
df1_song = df1_song.drop_duplicates()

# join datasets together

In [107]:
df1_song['id'] = range(len(df1_song))

In [108]:
df1_song.head()

   year        artist                    track  time  id
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22   0
1  2000       2Ge+her  The Hardest Part Of ...  3:15   1
2  2000  3 Doors Down               Kryptonite  3:53   2
3  2000  3 Doors Down                    Loser  4:24   3
4  2000      504 Boyz            Wobble Wobble  3:35   4

In [110]:
df1_song.to_csv('C:/Temp/Dataset/data/df1_songs.csv', index=False) # create a dataset and save it

In [111]:
df1_rating = df1_long.merge(df1_song, on =['year', 'artist', 'track', 'time'])
df1_rating.head()

   year artist                    track  time date.entered week  rating  id
0  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk1    87.0   0
1  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk2    82.0   0
2  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk3    72.0   0
3  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk4    77.0   0
4  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk5    87.0   0

In [113]:
df1_rating = df1_rating[['id', 'date.entered', 'week', 'rating']]
df1_rating.head()

   id date.entered week  rating
0   0   2000-02-26  wk1    87.0
1   0   2000-02-26  wk2    82.0
2   0   2000-02-26  wk3    72.0
3   0   2000-02-26  wk4    77.0
4   0   2000-02-26  wk5    87.0

In [114]:
df1_rating.sample(30)

        id date.entered  week  rating
12254  161   2000-03-25  wk19     NaN
17672  232   2000-05-13  wk41     NaN
16871  221   2000-03-25  wk76     NaN
8450   111   2000-01-08  wk15     NaN
446      5   2000-08-19  wk67     NaN
14597  192   2000-03-11   wk6     NaN
7319    96   2000-06-10  wk24     NaN
20538  270   2000-07-08  wk19    31.0
1207    15   2000-01-22  wk68     NaN
5488    72   2000-03-25  wk17    51.0
20992  276   2000-05-13  wk17    19.0
17523  230   2000-10-14  wk44     NaN
3989    52   1999-12-11  wk38     NaN
647      8   2000-03-18  wk40     NaN
17299  227   2000-06-03  wk48     NaN
6802    89   2000-07-01  wk39     NaN
3176    41   2000-03-18  wk61     NaN
17588  231   2000-07-29  wk33     NaN
8004   105   2000-10-28  wk25     NaN
15819  208   2000-02-12  wk12     NaN
22479  295   2000-12-30  wk60     NaN
23703  311   2000-03-04  wk68     NaN
10446  137   2000-06-24  wk35     NaN
4326    56   2000-10-21  wk71     NaN
18433  242   2000-05-06  wk42     NaN
24081  316   2000-04-29  wk66     NaN
17012  223   2000-05-27  wk65     NaN
22317  293   2000-09-09  wk50     NaN
16951  223   2000-05-27   wk4    40.0
2750    36   1999-11-13  wk15    94.0

In [115]:
df1_rating.to_csv('C:/Temp/Dataset/data/df1_rating.csv', index=False) # create a dataset and save it

In [116]:
df1_rating.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24092 entries, 0 to 24091
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            24092 non-null  int32
 1   date.entered  24092 non-null  object
 2   week          24092 non-null  object
 3   rating        5307 non-null   float64
dtypes: float64(1), int32(1), object(2)
memory usage: 847.0+ KB